GopalSaraf/Practicals/PSDL/include/proc/pic16c781.inc
// Register: PMDATH
#define PMDATH PMDATH
PMDATH                                   equ 010Eh

// Register: PMADRH
#define PMADRH PMADRH
PMADRH                                   equ 010Fh

// Register: CALCON
#define CALCON CALCON
CALCON                                   equ 0110h
// bitfield definitions
CALCON_CALREF_POSN                       equ 0005h
CALCON_CALREF_POSITION                   equ 0005h
CALCON_CALREF_SIZE                       equ 0001h
CALCON_CALREF_LENGTH                     equ 0001h
CALCON_CALREF_MASK                       equ 0020h
CALCON_CALERR_POSN                       equ 0006h
CALCON_CALERR_POSITION                   equ 0006h
CALCON_CALERR_SIZE                       equ 0001h
CALCON_CALERR_LENGTH                     equ 0001h
CALCON_CALERR_MASK                       equ 0040h
CALCON_CAL_POSN                          equ 0007h
CALCON_CAL_POSITION                      equ 0007h
CALCON_CAL_SIZE                          equ 0001h
CALCON_CAL_LENGTH                        equ 0001h
CALCON_CAL_MASK                          equ 0080h

// Register: PSMCCON0
#define PSMCCON0 PSMCCON0
PSMCCON0                                 equ 0111h
// bitfield definitions
PSMCCON0_DC_POSN                         equ 0000h
PSMCCON0_DC_POSITION                     equ 0000h
PSMCCON0_DC_SIZE                         equ 0002h
PSMCCON0_DC_LENGTH                       equ 0002h
PSMCCON0_DC_MASK                         equ 0003h
PSMCCON0_MAXDC_POSN                      equ 0002h
PSMCCON0_MAXDC_POSITION                  equ 0002h
PSMCCON0_MAXDC_SIZE                      equ 0002h
PSMCCON0_MAXDC_LENGTH                    equ 0002h
PSMCCON0_MAXDC_MASK                      equ 000Ch
PSMCCON0_MINDC_POSN                      equ 0004h
PSMCCON0_MINDC_POSITION                  equ 0004h
PSMCCON0_MINDC_SIZE                      equ 0002h
PSMCCON0_MINDC_LENGTH                    equ 0002h
PSMCCON0_MINDC_MASK                      equ 0030h
PSMCCON0_SMCCL_POSN                      equ 0006h
PSMCCON0_SMCCL_POSITION                  equ 0006h
PSMCCON0_SMCCL_SIZE                      equ 0002h
PSMCCON0_SMCCL_LENGTH                    equ 0002h
PSMCCON0_SMCCL_MASK                      equ 00C0h
PSMCCON0_DC0_POSN                        equ 0000h
PSMCCON0_DC0_POSITION                    equ 0000h
PSMCCON0_DC0_SIZE                        equ 0001h
PSMCCON0_DC0_LENGTH                      equ 0001h
PSMCCON0_DC0_MASK                        equ 0001h
PSMCCON0_DC1_POSN                        equ 0001h
PSMCCON0_DC1_POSITION                    equ 0001h
PSMCCON0_DC1_SIZE                        equ 0001h
PSMCCON0_DC1_LENGTH                      equ 0001h
PSMCCON0_DC1_MASK                        equ 0002h
PSMCCON0_MAXDC0_POSN                     equ 0002h
PSMCCON0_MAXDC0_POSITION                 equ 0002h
PSMCCON0_MAXDC0_SIZE                     equ 0001h
PSMCCON0_MAXDC0_LENGTH                   equ 0001h
PSMCCON0_MAXDC0_MASK                     equ 0004h
PSMCCON0_MAXDC1_POSN                     equ 0003h
PSMCCON0_MAXDC1_POSITION                 equ 0003h
PSMCCON0_MAXDC1_SIZE                     equ 0001h
PSMCCON0_MAXDC1_LENGTH                   equ 0001h
PSMCCON0_MAXDC1_MASK                     equ 0008h
PSMCCON0_MINDC0_POSN                     equ 0004h
PSMCCON0_MINDC0_POSITION                 equ 0004h
PSMCCON0_MINDC0_SIZE                     equ 0001h
PSMCCON0_MINDC0_LENGTH                   equ 0001h
PSMCCON0_MINDC0_MASK                     equ 0010h
PSMCCON0_MINDC1_POSN                     equ 0005h
PSMCCON0_MINDC1_POSITION                 equ 0005h
PSMCCON0_MINDC1_SIZE                     equ 0001h
PSMCCON0_MINDC1_LENGTH                   equ 0001h
PSMCCON0_MINDC1_MASK                     equ 0020h
PSMCCON0_SMCCL0_POSN                     equ 0006h
PSMCCON0_SMCCL0_POSITION                 equ 0006h
PSMCCON0_SMCCL0_SIZE                     equ 0001h
PSMCCON0_SMCCL0_LENGTH                   equ 0001h
PSMCCON0_SMCCL0_MASK                     equ 0040h
PSMCCON0_SMCCL1_POSN                     equ 0007h
PSMCCON0_SMCCL1_POSITION                 equ 0007h
PSMCCON0_SMCCL1_SIZE                     equ 0001h
PSMCCON0_SMCCL1_LENGTH                   equ 0001h
PSMCCON0_SMCCL1_MASK                     equ 0080h

// Register: PSMCCON1
#define PSMCCON1 PSMCCON1
PSMCCON1                                 equ 0112h
// bitfield definitions
PSMCCON1_SMCCS_POSN                      equ 0000h
PSMCCON1_SMCCS_POSITION                  equ 0000h
PSMCCON1_SMCCS_SIZE                      equ 0001h
PSMCCON1_SMCCS_LENGTH                    equ 0001h
PSMCCON1_SMCCS_MASK                      equ 0001h
PSMCCON1_PWM_nPSM_POSN                   equ 0001h
PSMCCON1_PWM_nPSM_POSITION               equ 0001h
PSMCCON1_PWM_nPSM_SIZE                   equ 0001h
PSMCCON1_PWM_nPSM_LENGTH                 equ 0001h
PSMCCON1_PWM_nPSM_MASK                   equ 0002h
PSMCCON1_SMCOM_POSN                      equ 0002h
PSMCCON1_SMCOM_POSITION                  equ 0002h
PSMCCON1_SMCOM_SIZE                      equ 0001h
PSMCCON1_SMCOM_LENGTH                    equ 0001h
PSMCCON1_SMCOM_MASK                      equ 0004h
PSMCCON1_SCEN_POSN                       equ 0003h
PSMCCON1_SCEN_POSITION                   equ 0003h
PSMCCON1_SCEN_SIZE                       equ 0001h
PSMCCON1_SCEN_LENGTH                     equ 0001h
PSMCCON1_SCEN_MASK                       equ 0008h
PSMCCON1_S1BPOL_POSN                     equ 0005h
PSMCCON1_S1BPOL_POSITION                 equ 0005h
PSMCCON1_S1BPOL_SIZE                     equ 0001h
PSMCCON1_S1BPOL_LENGTH                   equ 0001h
PSMCCON1_S1BPOL_MASK                     equ 0020h
PSMCCON1_S1APOL_POSN                     equ 0006h
PSMCCON1_S1APOL_POSITION                 equ 0006h
PSMCCON1_S1APOL_SIZE                     equ 0001h
PSMCCON1_S1APOL_LENGTH                   equ 0001h
PSMCCON1_S1APOL_MASK                     equ 0040h
PSMCCON1_SMCON_POSN                      equ 0007h
PSMCCON1_SMCON_POSITION                  equ 0007h
PSMCCON1_SMCON_SIZE                      equ 0001h
PSMCCON1_SMCON_LENGTH                    equ 0001h
PSMCCON1_SMCON_MASK                      equ 0080h
PSMCCON1_PWM_POSN                        equ 0001h
PSMCCON1_PWM_POSITION                    equ 0001h
PSMCCON1_PWM_SIZE                        equ 0001h
PSMCCON1_PWM_LENGTH                      equ 0001h
PSMCCON1_PWM_MASK                        equ 0002h
PSMCCON1_PSM_POSN                        equ 0001h
PSMCCON1_PSM_POSITION                    equ 0001h
PSMCCON1_PSM_SIZE                        equ 0001h
PSMCCON1_PSM_LENGTH                      equ 0001h
PSMCCON1_PSM_MASK                        equ 0002h
PSMCCON1_nPSM_POSN                       equ 0001h
PSMCCON1_nPSM_POSITION                   equ 0001h
PSMCCON1_nPSM_SIZE                       equ 0001h
PSMCCON1_nPSM_LENGTH                     equ 0001h
PSMCCON1_nPSM_MASK                       equ 0002h

// Register: CM1CON0
#define CM1CON0 CM1CON0
CM1CON0                                  equ 0119h
// bitfield definitions
CM1CON0_C1CH_POSN                        equ 0000h
CM1CON0_C1CH_POSITION                    equ 0000h
CM1CON0_C1CH_SIZE                        equ 0002h
CM1CON0_C1CH_LENGTH                      equ 0002h
CM1CON0_C1CH_MASK                        equ 0003h
CM1CON0_C1R_POSN                         equ 0002h
CM1CON0_C1R_POSITION                     equ 0002h
CM1CON0_C1R_SIZE                         equ 0001h
CM1CON0_C1R_LENGTH                       equ 0001h
CM1CON0_C1R_MASK                         equ 0004h
CM1CON0_C1SP_POSN                        equ 0003h
CM1CON0_C1SP_POSITION                    equ 0003h
CM1CON0_C1SP_SIZE                        equ 0001h
CM1CON0_C1SP_LENGTH                      equ 0001h
CM1CON0_C1SP_MASK                        equ 0008h
CM1CON0_C1POL_POSN                       equ 0004h
CM1CON0_C1POL_POSITION                   equ 0004h
CM1CON0_C1POL_SIZE                       equ 0001h
CM1CON0_C1POL_LENGTH                     equ 0001h
CM1CON0_C1POL_MASK                       equ 0010h
CM1CON0_C1OE_POSN                        equ 0005h
CM1CON0_C1OE_POSITION                    equ 0005h
CM1CON0_C1OE_SIZE                        equ 0001h
CM1CON0_C1OE_LENGTH                      equ 0001h
CM1CON0_C1OE_MASK                        equ 0020h
CM1CON0_C1OUT_POSN                       equ 0006h
CM1CON0_C1OUT_POSITION                   equ 0006h
CM1CON0_C1OUT_SIZE                       equ 0001h
CM1CON0_C1OUT_LENGTH                     equ 0001h
CM1CON0_C1OUT_MASK                       equ 0040h
CM1CON0_C1ON_POSN                        equ 0007h
CM1CON0_C1ON_POSITION                    equ 0007h
CM1CON0_C1ON_SIZE                        equ 0001h
CM1CON0_C1ON_LENGTH                      equ 0001h
CM1CON0_C1ON_MASK                        equ 0080h
CM1CON0_C1CH0_POSN                       equ 0000h
CM1CON0_C1CH0_POSITION                   equ 0000h
CM1CON0_C1CH0_SIZE                       equ 0001h
CM1CON0_C1CH0_LENGTH                     equ 0001h
CM1CON0_C1CH0_MASK                       equ 0001h
CM1CON0_C1CH1_POSN                       equ 0001h
CM1CON0_C1CH1_POSITION                   equ 0001h
CM1CON0_C1CH1_SIZE                       equ 0001h
CM1CON0_C1CH1_LENGTH                     equ 0001h
CM1CON0_C1CH1_MASK                       equ 0002h

// Register: CM2CON0
#define CM2CON0 CM2CON0
CM2CON0                                  equ 011Ah
// bitfield definitions
CM2CON0_C2CH_POSN                        equ 0000h
CM2CON0_C2CH_POSITION                    equ 0000h
CM2CON0_C2CH_SIZE                        equ 0002h
CM2CON0_C2CH_LENGTH                      equ 0002h
CM2CON0_C2CH_MASK                        equ 0003h
CM2CON0_C2R_POSN                         equ 0002h
CM2CON0_C2R_POSITION                     equ 0002h
CM2CON0_C2R_SIZE                         equ 0001h
CM2CON0_C2R_LENGTH                       equ 0001h
CM2CON0_C2R_MASK                         equ 0004h
CM2CON0_C2SP_POSN                        equ 0003h
CM2CON0_C2SP_POSITION                    equ 0003h
CM2CON0_C2SP_SIZE                        equ 0001h
CM2CON0_C2SP_LENGTH                      equ 0001h
CM2CON0_C2SP_MASK                        equ 0008h
CM2CON0_C2POL_POSN                       equ 0004h
CM2CON0_C2POL_POSITION                   equ 0004h
CM2CON0_C2POL_SIZE                       equ 0001h
CM2CON0_C2POL_LENGTH                     equ 0001h
CM2CON0_C2POL_MASK                       equ 0010h
CM2CON0_C2OE_POSN                        equ 0005h
CM2CON0_C2OE_POSITION                    equ 0005h
CM2CON0_C2OE_SIZE                        equ 0001h
CM2CON0_C2OE_LENGTH                      equ 0001h
CM2CON0_C2OE_MASK                        equ 0020h
CM2CON0_C2OUT_POSN                       equ 0006h
CM2CON0_C2OUT_POSITION                   equ 0006h
CM2CON0_C2OUT_SIZE                       equ 0001h
CM2CON0_C2OUT_LENGTH                     equ 0001h
CM2CON0_C2OUT_MASK                       equ 0040h
CM2CON0_C2ON_POSN                        equ 0007h
CM2CON0_C2ON_POSITION                    equ 0007h
CM2CON0_C2ON_SIZE                        equ 0001h
CM2CON0_C2ON_LENGTH                      equ 0001h
CM2CON0_C2ON_MASK                        equ 0080h
CM2CON0_C2CH0_POSN                       equ 0000h
CM2CON0_C2CH0_POSITION                   equ 0000h
CM2CON0_C2CH0_SIZE                       equ 0001h
CM2CON0_C2CH0_LENGTH                     equ 0001h
CM2CON0_C2CH0_MASK                       equ 0001h
CM2CON0_C2CH1_POSN                       equ 0001h
CM2CON0_C2CH1_POSITION                   equ 0001h
CM2CON0_C2CH1_SIZE                       equ 0001h
CM2CON0_C2CH1_LENGTH                     equ 0001h
CM2CON0_C2CH1_MASK                       equ 0002h

// Register: CM2CON1
#define CM2CON1 CM2CON1
CM2CON1                                  equ 011Bh
// bitfield definitions
CM2CON1_C2SYNC_POSN                      equ 0000h
CM2CON1_C2SYNC_POSITION                  equ 0000h
CM2CON1_C2SYNC_SIZE                      equ 0001h
CM2CON1_C2SYNC_LENGTH                    equ 0001h
CM2CON1_C2SYNC_MASK                      equ 0001h
CM2CON1_MC2OUT_POSN                      equ 0006h
CM2CON1_MC2OUT_POSITION                  equ 0006h
CM2CON1_MC2OUT_SIZE                      equ 0001h
CM2CON1_MC2OUT_LENGTH                    equ 0001h
CM2CON1_MC2OUT_MASK                      equ 0040h
CM2CON1_MC1OUT_POSN                      equ 0007h
CM2CON1_MC1OUT_POSITION                  equ 0007h
CM2CON1_MC1OUT_SIZE                      equ 0001h
CM2CON1_MC1OUT_LENGTH                    equ 0001h
CM2CON1_MC1OUT_MASK                      equ 0080h

// Register: OPACON
#define OPACON OPACON
OPACON                                   equ 011Ch
// bitfield definitions
OPACON_GBWP_POSN                         equ 0000h
OPACON_GBWP_POSITION                     equ 0000h
OPACON_GBWP_SIZE                         equ 0001h
OPACON_GBWP_LENGTH                       equ 0001h
OPACON_GBWP_MASK                         equ 0001h
OPACON_CMPEN_POSN                        equ 0006h
OPACON_CMPEN_POSITION                    equ 0006h
OPACON_CMPEN_SIZE                        equ 0001h
OPACON_CMPEN_LENGTH                      equ 0001h
OPACON_CMPEN_MASK                        equ 0040h
OPACON_OPAON_POSN                        equ 0007h
OPACON_OPAON_POSITION                    equ 0007h
OPACON_OPAON_SIZE                        equ 0001h
OPACON_OPAON_LENGTH                      equ 0001h
OPACON_OPAON_MASK                        equ 0080h

// Register: DAC
#define DAC DAC
DAC                                      equ 011Eh
// bitfield definitions
DAC_DA0_POSN                             equ 0000h
DAC_DA0_POSITION                         equ 0000h
DAC_DA0_SIZE                             equ 0001h
DAC_DA0_LENGTH                           equ 0001h
DAC_DA0_MASK                             equ 0001h
DAC_DA1_POSN                             equ 0001h
DAC_DA1_POSITION                         equ 0001h
DAC_DA1_SIZE                             equ 0001h
DAC_DA1_LENGTH                           equ 0001h
DAC_DA1_MASK                             equ 0002h
DAC_DA2_POSN                             equ 0002h
DAC_DA2_POSITION                         equ 0002h
DAC_DA2_SIZE                             equ 0001h
DAC_DA2_LENGTH                           equ 0001h
DAC_DA2_MASK                             equ 0004h
DAC_DA3_POSN                             equ 0003h
DAC_DA3_POSITION                         equ 0003h
DAC_DA3_SIZE                             equ 0001h
DAC_DA3_LENGTH                           equ 0001h
DAC_DA3_MASK                             equ 0008h
DAC_DA4_POSN                             equ 0004h
DAC_DA4_POSITION                         equ 0004h
DAC_DA4_SIZE                             equ 0001h
DAC_DA4_LENGTH                           equ 0001h
DAC_DA4_MASK                             equ 0010h
DAC_DA5_POSN                             equ 0005h
DAC_DA5_POSITION                         equ 0005h
DAC_DA5_SIZE                             equ 0001h
DAC_DA5_LENGTH                           equ 0001h
DAC_DA5_MASK                             equ 0020h
DAC_DA6_POSN                             equ 0006h
DAC_DA6_POSITION                         equ 0006h
DAC_DA6_SIZE                             equ 0001h
DAC_DA6_LENGTH                           equ 0001h
DAC_DA6_MASK                             equ 0040h
DAC_DA7_POSN                             equ 0007h
DAC_DA7_POSITION                         equ 0007h
DAC_DA7_SIZE                             equ 0001h
DAC_DA7_LENGTH                           equ 0001h
DAC_DA7_MASK                             equ 0080h

// Register: DACON0
#define DACON0 DACON0
DACON0                                   equ 011Fh
// bitfield definitions
DACON0_DARS_POSN                         equ 0000h
DACON0_DARS_POSITION                     equ 0000h
DACON0_DARS_SIZE                         equ 0002h
DACON0_DARS_LENGTH                       equ 0002h
DACON0_DARS_MASK                         equ 0003h
DACON0_DAOE_POSN                         equ 0006h
DACON0_DAOE_POSITION                     equ 0006h
DACON0_DAOE_SIZE                         equ 0001h
DACON0_DAOE_LENGTH                       equ 0001h
DACON0_DAOE_MASK                         equ 0040h
DACON0_DAON_POSN                         equ 0007h
DACON0_DAON_POSITION                     equ 0007h
DACON0_DAON_SIZE                         equ 0001h
DACON0_DAON_LENGTH                       equ 0001h
DACON0_DAON_MASK                         equ 0080h
DACON0_DARS0_POSN                        equ 0000h
DACON0_DARS0_POSITION                    equ 0000h
DACON0_DARS0_SIZE                        equ 0001h
DACON0_DARS0_LENGTH                      equ 0001h
DACON0_DARS0_MASK                        equ 0001h
DACON0_DARS1_POSN                        equ 0001h
DACON0_DARS1_POSITION                    equ 0001h
DACON0_DARS1_SIZE                        equ 0001h
DACON0_DARS1_LENGTH                      equ 0001h
DACON0_DARS1_MASK                        equ 0002h

